import numpy as np
import matplotlib.pyplot as plt
from scipy.stats import norm

# Данные из таблицы
data = [4.91, 5.03, 4.93, 4.84, 4.81, 4.94, 5.34, 4.78, 5.00, 5.03, 
        4.81, 4.91, 4.65, 5.03, 4.72, 4.91, 4.62, 4.72, 5.00, 4.87, 
        4.90, 4.90, 4.78, 4.97, 4.60, 4.75, 5.03, 4.94, 4.93, 4.75, 
        4.90, 5.06, 5.06, 4.66, 5.12, 5.09, 5.10, 4.84, 4.97, 5.00, 
        4.84, 5.00, 4.81, 5.07, 4.97, 5.00, 4.94, 4.87, 4.91, 4.85]

# Вычисление среднего и стандартного отклонения
mean = np.mean(data)
std = np.std(data)

# Построение гистограммы данных
plt.hist(data, density=True, bins=7, color='b', label='Гистограмма')

# Построение функции плотности вероятности (Гаусс)
xmin, xmax = plt.xlim()
x = np.linspace(xmin, xmax, 100)
p = norm.pdf(x, mean, std)
plt.plot(x, p, 'k', linewidth=2, label='Гауссово распределение')

# Добавление подписей и заголовка
plt.xlabel('Время (секунды)')
plt.ylabel('Плотность')
plt.title('Гистограмма и функция плотности вероятности')

# Добавление легенды
plt.legend(loc='best')

# Показ графика
plt.show()
